In [ ]:
1 . Find out how many male and female passenger was onboarded .
2. how many survived we have .
3. how many casuality we have 
4 . what is name of a person who is the eldest one . 
5 . how many passenger do we have in first , second and third class 
6. how many person we have whose name starts with "s"
7. try to create a new column which is a summation  of "SibSp" and "parch"
8 . how many person do we have below age of 25 .
9 . how many person died whose age was less then 40 
10 . from a  cabin column seperate text and numeric value .

In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [6]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [ ]:
#1. Find out male and Female

In [7]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [ ]:
#alternative

In [9]:
df.groupby('Sex')['Sex'].count()

Sex
female    314
male      577
Name: Sex, dtype: int64

In [11]:
len(df[df['Sex'] == 'male'])

577

In [12]:
len(df[df['Sex'] == 'female'])

314

In [ ]:
#2. no of survived

In [13]:
df['Survived'] == 1

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: Survived, Length: 891, dtype: bool

In [15]:
len(df[df['Survived'] == 1])

342

In [ ]:
#alternative

In [17]:
df.groupby('Survived')['Survived'].count()[1]

342

In [ ]:
#3. Casuality

In [18]:
len(df[df['Survived'] ==0])

549

In [ ]:
#alternative

In [19]:
df.groupby('Survived')['Survived'].count()[0]

549

In [ ]:
#4.Name of person who is eldest

In [23]:
df['Age'].max()

80.0

In [26]:
df[df['Age'] == df['Age'].max() ]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [22]:
df[df['Age'] == df['Age'].max() ]['Name']

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

In [ ]:
#5.People in each Pclass

In [27]:
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [28]:
df.groupby('Pclass')['Pclass'].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

In [ ]:
#6.How many people with name start with 'S'

In [29]:
count = 0
for i in df['Name']:
    if i[0]== "s" or i[0] == "S":
        count +=1
print(count)

86

In [ ]:
#Alternative

In [33]:
df[df['Name'].str.startswith('S')]

86

In [34]:
df[df['Name'].str.startswith('S')]['Name']

10                       Sandstrom, Miss. Marguerite Rut
12                        Saundercock, Mr. William Henry
23                          Sloper, Mr. William Thompson
31        Spencer, Mrs. William Augustus (Marie Eugenie)
48                                   Samaan, Mr. Youssef
                             ...
851                                  Svensson, Mr. Johan
862    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
863                    Sage, Miss. Dorothy Edith "Dolly"
880         Shelley, Mrs. William (Imanita Parrish Hall)
884                               Sutehall, Mr. Henry Jr
Name: Name, Length: 86, dtype: object

In [35]:
df[df['Name'].str.startswith('S')]['Name'].count()

86

In [ ]:
# create new coulmn which is sum of SibSp + Parch

In [36]:
df['SibSp_Parch'] = df['SibSp'] + df['Parch']

In [37]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SibSp_Parch
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1

In [ ]:
#8.How many people belwo 25 age

In [41]:
df[df['Age'] < 25].count()['Age']

278

In [42]:
len(df[df['Age'] <25])

278

In [ ]:
#9 How amny died whos age is below 40 age

In [44]:
df_not_survived = df[df['Survived'] == 0]
df_not_survived.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SibSp_Parch
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S,0

In [47]:
len(df_not_survived[df_not_survived['Age'] <40])

322

In [ ]:
#10. Seperate Cabin column into num and char

In [48]:
df['Cabin'].head(5)

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [49]:
char = []
num = []
for i in df['Cabin']:
    string1 = ''
    string2 = ''
    if type(i) == str:
        for ch in i:
            if ch >= 'A' and ch <= 'Z' or ch >= 'a' and ch <= 'z':
                string1 += ch
            else:
                string2 += ch
        
        char.append(string1)
        num.append(string2)
        
    else:
        char.append(i)
        num.append(i)

In [51]:
df['Cabin_char'] =char

In [50]:
df['Cabin_num'] = num